[
    {
        "question": "Pergunta: Ana, Cláudia, Joaquim, Pedro e Fabiana se esconderam durante uma brincadeira. Nessa brincadeira,\n• havia exatamente duas crianças na casa da árvore;\n• Pedro, que nasceu em São Paulo, se escondeu junto com Fabiana;\n• uma menina se escondeu sozinha;\n• Ana não estava sozinha em seu esconderijo;\n• o menino pernambucano estava na casa da árvore.\n\nQuem estava na casa da árvore?\n(A) Pedro e Fabiana.\n(B) Joaquim e Cláudia.\n(C) Ana e Joaquim.\n(D) Pedro e Ana.\n(E) Cláudia e Fabiana.\nResposta: De acordo com a afirmação II), Pedro nasceu em São Paulo e, de acordo com a afirmação V), o menino pernambucano estava na casa da árvore. Portanto, Joaquim estava na casa da árvore.\nComo Pedro e Fabiana se esconderam juntos, e como Joaquim estava na casa da árvore, Pedro e Fabiana não podiam estar na casa da árvore, pois, nesse caso, teríamos três crianças na casa da árvore, o que contradiria a afirmação I). A outra criança na casa da árvore deve ser ou Ana ou Cláudia.\nA resposta é (C).\nComo uma menina se escondeu sozinha (afirmação III)) e Ana não estava sozinha (afirmação IV)), Ana estava na casa da árvore e Cláudia, sozinha.\n\nConcluímos que Ana e Joaquim estavam escondidos na casa da árvore.\nGabarito: Letra C.",
        "source": "http://www.obmep.org.br/provas.htm",
        "question-id": 7.0
    },
    {
        "question": "Pergunta: Jogar baralho é uma atividade que estimula o raciocínio. Um jogo tradicional é a Paciência, que utiliza 52 cartas. Inicialmente são formadas sete colunas com as cartas. A primeira coluna tem uma carta, a segunda tem duas cartas, a terceira tem três cartas, a quarta tem quatro cartas, e assim sucessivamente até a sétima coluna, a qual tem sete cartas, e o que sobra forma o monte, que são as cartas não utilizadas nas colunas.\n\nA quantidade de cartas que forma o monte é\n\na) 21.\nb) 24.\nc) 26.\nd) 28.\ne) 31.\nResposta: Para descobrir o número de cartas que sobraram no monte, devemos diminuir do número total de cartas do número de cartas que foram utilizadas nas 7 colunas.\nO número total de cartas utilizadas nas colunas é encontrado somando-se as cartas de cada uma delas, deste modo, temos:\n\n1 + 2 + 3 + 4 + 5 + 6 + 7 = 28\nFazendo a substração, encontramos:\n52 - 28 = 24\nGabarito: Letra B.",
        "source": "https://www.todamateria.com.br/raciocinio-logico-exercicios/",
        "question-id": 8.0
    },
    {
        "question": "Pergunta: Quatro suspeitos de praticar um crime fazem as seguintes declarações:\nJoão: Carlos é o criminoso\nPedro: eu não sou criminoso\nCarlos: Paulo é o criminoso\nPaulo: Carlos está mentindo\nSabendo que apenas um dos suspeitos mente, determine quem é o criminoso.\na) João\nb) Pedro\nc) Carlos\nd) Paulo\nResposta: Apenas um suspeito mente e os outros dizem a verdade. Assim, há uma contradição entre a declaração de João e de Carlos.\n1ª opção: Se João diz a verdade, a declaração de Pedro pode ser verdadeira, a de Carlos seria falsa (por ser contraditória) e Paulo estaria falando a verdade.\n2ª opção: Se a declaração de João for a falsa e a declaração de Carlos for verdadeira, a declaração de Pedro pode ser verdadeira, mas a declaração de Paulo teria que ser falsa.\nLogo, seriam duas declarações falsas (João e Paulo), invalidando a questão (apenas uma falsidade).\nAssim, a única opção válida é João dizer a verdade e Carlos ser o criminoso.\nGabarito: Letra C.",
        "source": "https://www.todamateria.com.br/raciocinio-logico-exercicios/",
        "question-id": 10.0
    },
    {
        "question": "Pergunta: Os estudantes de uma escola foram divididos em equipes de 8 meninas e 5 meninos cada uma. Se nessa escola há 60 meninas a mais do que meninos, qual é o número total de estudantes?\nA) 130\nB) 260\nC) 390\nD) 520\nE) 650\nResposta: Em um grupo de 13 estudantes temos 8 meninas e 5 meninos, ou seja, 3 meninas a mais. Em 20 grupos de 13 estudantes teremos exatamente 60 meninas a mais do que meninos. Logo, no total temos 20 × 13 = 260 estudantes. A resposta é (B).\nGabarito: Letra B.",
        "source": "http://www.obmep.org.br/provas.htm",
        "question-id": 3.0
    },
    {
        "question": "Pergunta: Uma fábrica recebeu uma encomenda de 100 kg de bombons para entregar em 10 dias. Após 5 dias, seus 3 funcionários produziram 20 kg de bombons. No mínimo, quantos funcionários extras a fábrica precisa contratar para atender a encomenda no prazo, supondo-se que todos os funcionários tenham a mesma produção diária?\n(A) 5\n(B) 7\n(C) 8\n(D) 9\n(E) 12\nResposta: Se cada grupo de 3 funcionários produz 20 kg em 5 dias, para produzir 80 kg em 5 dias, são necessários 4 grupos de 3 funcionários, ou seja, 3 × 4 = 12 funcionários, pois 80 = 4 × 20. Logo, será necessário contratar mais 12 – 3 = 9 funcionários. A resposta é (D).\nGabarito: Letra D.",
        "source": "http://www.obmep.org.br/provas.htm",
        "question-id": 2.0
    },
    {
        "question": "Pergunta: Duas tartarugas estavam juntas e começaram a caminhar em linha reta em direção a um lago distante. A primeira tartaruga percorreu 30 metros por dia e demorou 16 dias para chegar ao lago. A segunda tartaruga só conseguiu percorrer 20 metros por dia e, portanto, chegou ao lago alguns dias depois da primeira. Quando a primeira tartaruga chegou ao lago, o número de dias que ela teve que esperar para a segunda tartaruga chegar foi:\na) 8\nb) 9\nc) 10\nd) 12\ne) 15\nResposta: Como a primeira tartaruga andou 30 metros por dia, em 16 dias terá percorrido:\n\n16 . 30 = 480 metros\nPara descobrir quanto tempo a segunda tartaruga levará para percorrer os 480 metros, basta dividir pelos 20 metros percorridos por dia, assim temos:\n480 : 20 = 24 dias\nAssim, o tempo de espera da primeira tartaruga será:\n24 - 16 = 8\nGabarito: Letra A.",
        "source": "https://www.todamateria.com.br/raciocinio-logico-exercicios/",
        "question-id": 9.0
    },
    {
        "question": "Pergunta: Ana, Beatriz, Cláudia, Daniela e Érica foram visitar a vovó Margarida. Beatriz chegou antes de Ana e depois de Daniela. Já Cláudia, Daniela e Érica chegaram uma em seguida da outra, nessa ordem. Quem foi a primeira a chegar?\nA) Ana\nB) Beatriz\nC) Cláudia\nD) Daniela\nE) Érica\nResposta: Vamos pensar nas netas como as letras A, B, C, D e E e descrever a ordem em que elas chegaram como uma sequência dessas letras, lida da esquerda para a direita. O enunciado nos diz que nessa sequência\n1. o B está à esquerda do A (Beatriz chegou antes de Ana);\n2. o B está à direita do D (Beatriz chegou depois de Daniela);\n3. o bloco CDE aparece sem letras intermediárias e com as letras nessa ordem (Cláudia, Daniela e Érica chegaram uma em seguida da outra, nessa ordem).\nAs informações 2 e 3 mostram que o B aparece à direita do bloco CDE, e a informação 1 diz que o A está à direitado B. A nossa sequência é, então, CDEBA, e concluímos que a primeira a chegar foi Cláudia. A resposta é (C).\nGabarito: Letra C.",
        "source": "http://www.obmep.org.br/provas.htm",
        "question-id": 4.0
    },
    {
        "question": "Pergunta: Vovó Vera quis saber qual de suas cinco netinhas tinha feito um desenho na parede de sua sala. As netinhas fizeram as seguintes declarações:\n• Emília: Não fui eu.\n• Luísa: Quem desenhou foi a Marília ou a Rafaela.\n• Marília: Não foi a Rafaela nem a Vitória.\n• Rafaela: Não foi a Luísa.\n• Vitória: Luísa não está dizendo a verdade.\n\nSe apenas uma das netinhas mentiu, quem fez o desenho?\nA) Emília\nB) Luísa\nC) Marília\nD) Rafaela\nE) Vitória\nResposta: Se quem desenhou na parede foi Emília, ela mentiu e também Vitória mentiu. Então isso não ocorreu, pois somente uma menina mentiu.\nSe quem desenhou na parede foi Luísa, ela mentiu e também Rafaela mentiu. Esse caso também não pode ter ocorrido.\nSe quem desenhou na parede foi Marília, somente Vitória mentiu. Isso está compatível com as exigências do enunciado.\nSe quem desenhou na parede foi Rafaela, Marília e Vitória mentiram. Esse caso também não pode ter ocorrido.\nSe quem desenhou foi Vitória, Luísa e Marília mentiram; isso também não deve ter acontecido.\nLogo, quem desenhou na parede da sala da Vovó Vera foi Marília. A resposta é (C).\nGabarito: Letra C.",
        "source": "http://www.obmep.org.br/provas.htm",
        "question-id": 6.0
    },
    {
        "question": "Pergunta: Admita que sejam válidas ambas as seguintes sentenças:\n• Pinóquio sempre mente;\n• Pinóquio diz: \"Todos os meus chapéus são verdes\".\nPodemos concluir dessas duas sentenças que:\n(A) Pinóquio tem pelo menos um chapéu.\n(B) Pinóquio tem apenas um chapéu verde.\n(C) Pinóquio não tem chapéus.\n(D) Pinóquio tem pelo menos um chapéu verde.\n(E) Pinóquio não tem chapéus verdes.\n\nResposta: Como Pinóquio mente, a frase “Todos os meus chapéus são verdes” deve ser falsa. Logo, existe pelo um chapéu de Pinóquio que não é verde. Podemos concluir, então, que Pinóquio tem pelo menos um chapéu (que não é verde). A resposta é (A).\nGabarito: Letra A.",
        "source": "http://www.obmep.org.br/provas.htm",
        "question-id": 1.0
    },
    {
        "question": "Pergunta: Quatro cartões, cada um deles com um número inteiro positivo, são tais que toda vez que somamos os números de três deles obtemos um número igual ou maior do que 24. Considere as seguintes afirmações:\n\nI) Todos os números são iguais ou maiores do que 8.\nII) Existem dois números cuja soma é igual ou maior do que 16.\nIII) Existem dois números cujo produto é igual ou maior do que 64.\n\nQuais afirmações são necessariamente verdadeiras?\n\nA) somente I e II\nB) somente I e III\nC) somente II e III\nD) somente II\nE) I, II e III\nResposta: A afirmação I é falsa, pois, por exemplo, os cartões com os números 1, 1, 22 e 22 satisfazem o enunciado e nem todos são iguais ou maiores do que 8.\nA afirmação II é verdadeira. Para ver isso, sejam a, b, c e d os números nos cartões. Sabemos que\na + b + c ≥ 24\na + b + d ≥ 24\na + c + d ≥ 24\nb + c + d ≥ 24\nDa primeira igualdade, podemos inferir que ou a ≥ 8 ou b ≥ 8 ou c ≥ 8. Sem perda de generalidade, suponhamos a ≥ 8. Analisemos agora a última das quatro equações acima; pelo mesmo motivo, um dos três números, b, c ou d, deve ser igual ou maior do que 8, digamos que b ≥ 8, novamente sem perda de generalidade. Logo, a + b ≥ 16.\nA afirmação III é verdadeira. Escolhendo a e b como acima, concluímos que a x b ≥ 64. \nA resposta é (C).\nGabarito: Letra C.",
        "source": "http://www.obmep.org.br/provas.htm",
        "question-id": 5.0
    }
]
